; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-39)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
(at ball38 roomb)
(at ball39 roomb)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
(at ball37 roomb)
(at ball38 roomb)
(at ball39 roomb)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 14 of 39
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 14 of 39
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 39
4. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 15 of 39
5. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 16 of 39
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 16 of 39
7. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 16 of 39
8. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 16 of 39
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 39
10. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 17 of 39
11. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 18 of 39
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 39
13. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 18 of 39
14. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 18 of 39
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 39
16. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at ball4 roomb) (free right)
   goals met: 19 of 39
17. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 20 of 39
18. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 39
19. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 20 of 39
20. (pick ball25 rooma right)
   deleted: (at ball25 rooma) (free right)
   added: (carry ball25 right)
   goals met: 20 of 39
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 39
22. (drop ball25 roomb right)
   deleted: (carry ball25 right)
   added: (at ball25 roomb) (free right)
   goals met: 21 of 39
23. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 22 of 39
24. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 39
25. (pick ball24 rooma left)
   deleted: (at ball24 rooma) (free left)
   added: (carry ball24 left)
   goals met: 22 of 39
26. (pick ball23 rooma right)
   deleted: (at ball23 rooma) (free right)
   added: (carry ball23 right)
   goals met: 22 of 39
27. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 39
28. (drop ball23 roomb right)
   deleted: (carry ball23 right)
   added: (at ball23 roomb) (free right)
   goals met: 23 of 39
29. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 24 of 39
30. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 39
31. (pick ball22 rooma left)
   deleted: (at ball22 rooma) (free left)
   added: (carry ball22 left)
   goals met: 24 of 39
32. (pick ball21 rooma right)
   deleted: (at ball21 rooma) (free right)
   added: (carry ball21 right)
   goals met: 24 of 39
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 39
34. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 25 of 39
35. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 26 of 39
36. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 39
37. (pick ball20 rooma left)
   deleted: (at ball20 rooma) (free left)
   added: (carry ball20 left)
   goals met: 26 of 39
38. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 26 of 39
39. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 39
40. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 27 of 39
41. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 28 of 39
42. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 39
43. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 28 of 39
44. (pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 28 of 39
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 39
46. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 29 of 39
47. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 30 of 39
48. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 39
49. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 30 of 39
50. (pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 30 of 39
51. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 39
52. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 31 of 39
53. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 32 of 39
54. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 39
55. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 32 of 39
56. (pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 32 of 39
57. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 39
58. (drop ball14 roomb right)
   deleted: (carry ball14 right)
   added: (at ball14 roomb) (free right)
   goals met: 33 of 39
59. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 34 of 39
60. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 39
61. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 34 of 39
62. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 34 of 39
63. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 39
64. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 35 of 39
65. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 36 of 39
66. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 36 of 39
67. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 36 of 39
68. (pick ball10 rooma right)
   deleted: (at ball10 rooma) (free right)
   added: (carry ball10 right)
   goals met: 36 of 39
69. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 36 of 39
70. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 37 of 39
71. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 38 of 39
72. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 38 of 39
73. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 38 of 39
74. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 38 of 39
75. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 39 of 39
